[
  {
    "title": "Lanterns Over River Street",
    "content": "On the night the city lost power, every shop on River Street shut its doors except the tiny tea house where we first met. The owner lit paper lanterns and set them in the windows, and the whole room turned the color of warm honey. We had planned to discuss practical things: work, rent, schedules. Instead, we ended up telling each other the fears we never say out loud. You admitted you were scared of choosing the wrong life. I admitted I was scared of choosing no life at all. Outside, people passed with phone flashlights, rushing home. Inside, time slowed. We drank jasmine tea, refilled it twice, and promised that whatever changed, we would never pretend to be strangers to each other again. Years later, when the lights flicker during a storm, we still make tea and sit by the window. That night taught us love is not a grand speech. It is two people staying, even when the world goes dim."
  },
  {
    "title": "The Library Seat by the Window",
    "content": "Every Wednesday at 6:10 p.m., you took the same seat by the library window and opened the same blue notebook. I pretended to study nearby, mostly because I liked how calm you looked while everyone else rushed. For two months we never spoke. Then one rainy evening, I arrived late and found your notebook on my chair with a sticky note that said, \"I think this is your spot too.\" We laughed, shared the desk, and worked in easy silence. By the end of winter, we had built a small routine: one coffee, two bookmarks, and a walk to the station where we compared the best lines we had read that week. Nothing dramatic happened, and maybe that is why it lasted. We did not fall in love in a single moment. We assembled it carefully, like pages in a book: one steady chapter after another."
  },
  {
    "title": "After the Midnight Flight",
    "content": "My flight landed at 12:43 a.m., and I expected to take a cab home alone. Instead, I saw you standing near baggage claim in a sweater I had accidentally taken years earlier and never returned. You said, \"I figured this was the right night to get it back.\" We had spent a long year in different countries, different time zones, surviving on voice notes and missed calls. We had also argued more than we ever had, sometimes over nothing, sometimes over everything. But that night, you did not bring flowers or speeches. You brought patience. You carried one bag, listened to the whole story of my exhausting trip, and waited while I cried in the parking lot for reasons I could not explain. On the drive home, we stopped for roadside pancakes at 2 a.m. and promised to stop trying to be perfect. Since then, we have chosen something better: honest, inconvenient, stubborn love."
  }
]
